/*=============================================================================
#     FileName: 6-9.cpp
#         Desc: 一球从100m落下，落下后反弹回原来高度的一半，再落下，求第十次落地时
经过多少m，第十次反弹的高度？
#       Author: ybooty
#        Email: ybooty@gmail.com
#     HomePage: 
#      Version: 0.0.1
#   LastChange: 2011-11-12 23:17:32
#      History:
=============================================================================*/
#include <stdio.h>
int main(){
    int i;
    float s = 100, h = s / 2; //这样定义h不好，应该把s换成一个常数。不好的原因我也说不出，可能潜意识里不想让两个变量在
                            //初始定义时联系太紧密
    for(i = 0;i < 10;i++) //而且我感觉应该是i < 9，因为你的题目写的是“第十次落地时”。我想了一下，应该是i < 9
    {
        s += 2 * h;
        h = h / 2;
    }
    printf("第十次落地经过：%fm\n", s);
    printf("第十次的高度:%fm\n", h);
}

